function building (input){
    let floors = Number(input[0]);
    let roomsPerFloor = Number(input[1]);
    

for (let f = floors; 1 <= f; f--){
  let buffer = "";
   for (r = 0; r < roomsPerFloor; r++){
    
    if (f === floors){
      buffer += "L" + f  + r + " ";
     } else if (f % 2 === 0){
      buffer += "O" + f  + r + " ";
     } else if (f % 2 !== 0){
      buffer += "A" + f  + r + " ";
     }
    
   }

   console.log(buffer)
}

}

building(["6", "4"]);


/* Напишете функция, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред), като са изпълнени следните условия:

•	На всеки четен етаж има само офиси
•	На всеки нечетен етаж има само апартаменти
•	Всеки апартамент се означава по следния начин : A{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0.
•	Всеки офис се означава по следния начин : O{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0.
•	На последният етаж винаги има апартаменти и те са по-големи от останалите, за това пред номера им пише 'L', вместо 'A'. Ако има само един етаж, то има само големи апартаменти!

Функцията получава масив от две цели числа - броят на етажите и броят на стаите за един етаж. 

var combinedString = one + ", " + two + ", " + three

  console.log(combinedString) // "1, 2, 3"
  console.log(one + ", " + two + ", " + three) // "1, 2, 3"
  */
